M-Blocks/MBlocks-MB/nRF51_SDK_7.2.0_cf547b5/examples/ble_central_and_peripheral/experimental/app_s130_demo/src/main.c
    if ((error_code = sd_ble_uuid_vs_add(&uuid128, &uuid_type)) != NRF_SUCCESS)
    {
        LOG_DEBUG("sd_ble_uuid_vs_add() error code 0x%x", error_code);
        APP_ASSERT (false);
    }

    own_service_uuid.type = uuid_type;

    if ((error_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &own_service_uuid, &own_service_handle)) != NRF_SUCCESS)
    {
        LOG_DEBUG("sd_ble_gatts_service_add() error code 0x%x", error_code);
        APP_ASSERT (false);
    }
    memset(&attr_md, 0, sizeof(ble_gatts_attr_md_t));
    memset(&cccd_md, 0, sizeof(ble_gatts_attr_md_t));
    memset(&char_md, 0, sizeof(ble_gatts_char_md_t)); 
    memset(&gs_own_char_handle, 0, sizeof(ble_gatts_char_handles_t));
    memset(&attr, 0, sizeof(ble_gatts_attr_t));

    attr_uuid.uuid = SERVICE_CHARACTERISTIC_UUID;
    attr_uuid.type = BLE_UUID_TYPE_BLE;
    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

    char_md.char_props.read = 1;                                                  /*Reading value permitted*/
    char_md.char_props.write = 1;                                                 /*Writing value with Write Request permitted*/
    char_md.char_props.write_wo_resp = 1;                                         /*Writing value with Write Command permitted*/
    char_md.char_props.auth_signed_wr = 0;                                        /*Writing value with Signed Write Command not permitted*/
    char_md.char_props.notify = 1;                                                /*Notications of value permitted*/
    char_md.char_props.indicate = 0;                                              /*Indications of value not permitted*/
    char_md.p_cccd_md = &cccd_md;
    attr.p_uuid = &attr_uuid;
    attr.p_attr_md = &attr_md;
    attr.max_len = sizeof(characteristic_value);
    attr.init_len = sizeof(characteristic_value);
    attr.init_offs = 0;
    attr.p_value = characteristic_value;

    if ((error_code = sd_ble_gatts_characteristic_add(own_service_handle, &char_md, &attr, &gs_own_char_handle)) != NRF_SUCCESS)
    {
        LOG_DEBUG("sd_ble_gatts_characteristic_add() error code 0x%x", error_code);
        APP_ASSERT (false);
    }

    /*Setting up a descriptor*/
    desc_uuid.uuid = SERVICE_CHARACTERISTIC_DESCRIPTOR_UUID;
    desc_uuid.type = BLE_UUID_TYPE_BLE;

    memset(&desc_md, 0, sizeof(ble_gatts_attr_md_t));
    desc_md.vloc = BLE_GATTS_VLOC_STACK;
    desc_md.vlen = 0;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&desc_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&desc_md.write_perm);

    memset(&desc, 0, sizeof(ble_gatts_attr_t));
    desc.p_value = own_desc_value;
    desc.init_len = sizeof(own_desc_value);
    desc.max_len = sizeof(own_desc_value);
    desc.p_uuid = &desc_uuid;
    desc.p_attr_md = &desc_md;

    if ((error_code = sd_ble_gatts_descriptor_add(gs_own_char_handle.value_handle, &desc, &own_desc_handle)) != NRF_SUCCESS)
    {
        LOG_DEBUG("sd_ble_gatts_descriptor_add() error code 0x%x", error_code);
        APP_ASSERT (false);
    };
}


/**@brief Function starts advertisement.
 *
 * @return
 * @retval      NRF_SUCCESS if advertisement is running, otherwise NRF error code.
*/
static uint32_t advertise(void)
{
    uint32_t             error_code  = NRF_ERROR_NOT_FOUND;
    uint8_t              scan_data[] = SCAN_RESPONSE_DATA;
    ble_gap_adv_params_t adv_params  = {0};


    uint8_t              adv_data[]  = {0x02, 0x01, BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED,  
                                        17, BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE, SERVICE_UUID128,
                                        (APPLICATION_NAME_SIZE + 1), 0x09, APPLICATION_NAME};

    LOG_INFO("Advertisement starts.");
    if ((error_code = sd_ble_gap_adv_data_set(adv_data, sizeof(adv_data), scan_data, sizeof(scan_data))) != NRF_SUCCESS)
    {
        LOG_DEBUG("sd_ble_gap_adv_data_set() error code 0x%x", error_code);
        return error_code;
    }
    
    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL; // Undirected advertisement
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    if ((error_code = sd_ble_gap_adv_start(&adv_params)) == NRF_SUCCESS)
    {
        gs_advertising_is_running = true;
    }
    else
    {
        LOG_DEBUG("sd_ble_gap_adv_start() error code 0x%x", error_code);
        return error_code;
    }
    return error_code;
}


/**@brief Function connects to given peer peripheral.
 *
 * @param[in]   peripheral_id   Peripheral to be cannected.
 *
 * @return
 * @retval      NRF_SUCCESS if connected, otherwise NRF error code.
*/
static uint32_t connect(uint16_t peripheral_id)
{
    uint32_t              error_code  = NRF_ERROR_NOT_FOUND;
    ble_gap_scan_params_t scan_params = {0};
    ble_gap_conn_params_t conn_params = {0};
    
    scan_params.selective         = 0;
    scan_params.active            = 0x01; /* Active scanning */
    scan_params.interval          = SCAN_INTERVAL;
    scan_params.window            = SCAN_WINDOW;
    scan_params.timeout           = SCAN_TIMEOUT;

    conn_params.min_conn_interval = PERIPHERAL_MIN_CONN_INTERVAL;
    conn_params.max_conn_interval = PERIPHERAL_MAX_CONN_INTERVAL;
    conn_params.slave_latency     = PERIPHERAL_SLAVE_LATENCY;
    conn_params.conn_sup_timeout  = PERIPHERAL_CONN_SUP_TIMEOUT;

    LOG_DEBUG("(Peripheral %i) Connecting.", peripheral_id);
    
    if ((error_code = sd_ble_gap_connect(&gs_hb_peripheral_address[peripheral_id], &scan_params, &conn_params)) != NRF_SUCCESS)
    {
        LOG_DEBUG("(Peripheral %i) Connection error - code = 0x%x", peripheral_id, error_code);
        return error_code;
    }
        
    if ((error_code = event_handle(BLE_GAP_EVT_CONNECTED, 2000, gs_evt_buf, sizeof(gs_evt_buf))) == NRF_SUCCESS)
    {
        LOG_DEBUG("(Peripheral %i) Connection established.", peripheral_id);
        LOG_INFO("(Peripheral %i) Connected.", peripheral_id);
        gs_peripheral[peripheral_id].conn_handle = gsp_ble_evt->evt.gap_evt.conn_handle;
    }
    else
    {
        LOG_DEBUG("(Peripheral %i) Connection error: error code 0x%x", peripheral_id, error_code);
        if (error_code == NRF_ERROR_NOT_FOUND)
        {
            gs_peripheral[peripheral_id].conn_handle = BLE_CONN_HANDLE_INVALID;
            sd_ble_gap_connect_cancel();
            LOG_INFO("(Peripheral %i) Device not found.", peripheral_id);
        }
    }
    return error_code;
}


/**@brief Function discovers service, characteristic and descriptor for Heart Rate Service at given peer peripheral.
 *
 *  Function looks for Heart Rate Server and its handle that is used to write notification requests.
 *  If found the handle is kept in gs_peripheral[peripheral_id].descriptor_handle that is later used when writing CCCD.
 *
 * @param[in]   peripheral_id   Peripheral to be cannected.
 *
 * @return
 * @retval      NRF_SUCCESS if discovery done without NRF errors
 *              otherwise NRF error code.
 *              Getting NRF_SUCCESS doesn't guarante finding the right handle. It needs to be verified as found in gs_peripheral[peripheral_id].descriptor_handle.
*/
static uint32_t discovery(uint16_t peripheral_id)
{
    uint32_t                 error_code           = NRF_ERROR_NOT_FOUND;
    ble_gattc_handle_range_t handle_range         = {0};
    uint8_t                  i                    = 0;
    uint8_t                  service_found        = 0;
    uint8_t                  characteristic_found = 0;
                             
